//// @file
//
// TODO: Brief Description of UEFI Driver MyTestDriver
//  
// TODO: Detailed Description of UEFI Driver MyTestDriver
//
// TODO: Copyright for UEFI Driver MyTestDriver
//  
// TODO: License for UEFI Driver MyTestDriver
// 
////

#langdef en "English"

#string STR_SAMPLE_FORM_SET_TITLE           #language en  "My Test Driver Sample Formset"
#string STR_SAMPLE_FORM_SET_HELP            #language en  "Help for Sample Formset"
#string STR_SAMPLE_FORM1_TITLE              #language en  "My Test Driver"

#string STR_SUBTITLE_TEXT                   #language en "My Test Driver Configuration"
#string STR_SUBTITLE_TEXT2                  #language en "Device XYZ Configuration"
#string STR_CHECK_BOX_PROMPT                #language en "Enable My XYZ Device"
#string STR_CHECK_BOX_HELP                  #language en "This is the help message for the enable My XYZ device. Check this box to enable this device."
#string STR_STANDARD_DEFAULT_PROMPT         #language en "Standard Default"
#string STR_STANDARD_DEFAULT_PROMPT_RESET   #language en "Reset to Standard Default"
#string STR_STANDARD_DEFAULT_HELP           #language en "This will reset all the Questions to their standard default value"
#string STR_ONE_OF_PROMPT                   #language en "Select Base Address"
#string STR_ONE_OF_HELP                     #language en "Select a Base address of 400, 480 or 500 Hex. Values 0,1 or 2(default) is stored in the NVRAM Data"
#string STR_ONE_OF_TEXT1                    #language en "400 Hex"
#string STR_ONE_OF_TEXT2                    #language en "480 Hex"
#string STR_ONE_OF_TEXT3                    #language en "500 Hex"

#string STR_DATE_PROMPT                     #language en "System Date"
#string STR_DATE_HELP                       #language en "This is the help for the Date (month/day/year). (Error checking will be done against month/day/year combinations that are not supported.)"
#string STR_TIME_PROMPT                     #language en "System Time"
#string STR_TIME_HELP                       #language en "This is the help for the Time (hour/minute/second)."
#string STR_ERROR_POPUP                     #language en "You typed in the wrong value!
#string STR_MY_DATE_PROMPT                  #language en "My System Date"
#string STR_MY_TIME_PROMPT                  #language en "My System Time"